backend/app/Controllers/ControladorDetallePedido.php

SELECT *
FROM `detalle_pedido`
---
    public function index()
    {
        $modeloDetallePedido = new ModeloDetallePedido();
        $datos['detalle_pedido'] = $modeloDetallePedido->findall();