backend/app/Controllers/ControladorCliente.php

    public function index()
    {
        $modeloCliente = new ModeloCliente();
        $datos['clientes'] = $modeloCliente->findall();
---
SELECT *
FROM `clientes`