backend/app/Controllers/ControladorPizza.php

SELECT *
FROM `pizzas`
---
    public function index()
    {
        $modeloPizza = new ModeloPizza();
        $datos['pizzas'] = $modeloPizza->findall();