backend/app/Controllers/ControladorPedido.php

SELECT *
FROM `pedidos`
---
    public function index()
    {
        $modeloPedido = new ModeloPedido();
        $datos['pedidos'] = $modeloPedido->findall();