backend/app/Controllers/ControladorBebida.php

    public function index()
    {
        $modeloBebida = new ModeloBebida();
        $datos['bebidas'] = $modeloBebida->findall();
---
SELECT *
FROM `bebidas`