backend/app/Controllers/ControladorExtra.php

    public function index()
    {
        $modeloExtra = new ModeloExtra();
        $datos['extras'] = $modeloExtra->findall();
---
SELECT *
FROM `extras`